---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.ReverseIterator
source: html/9d263b9b-8aef-b9fb-9331-5b94713b07db.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual InsulationTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.